Revit 2024 API
FaceWall.IsWallTypeValidForFaceWall Method
 Identifies if a wall type may be applied to a face wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static bool IsWallTypeValidForFaceWall(
	Document document,
	ElementId wallType
)
Visual Basic
Public Shared Function IsWallTypeValidForFaceWall ( _
	document As Document, _
	wallType As ElementId _
) As Boolean
Visual C++
public:
static bool IsWallTypeValidForFaceWall(
	Document^ document,
	ElementId^ wallType
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
wallType
Type: Autodesk.Revit.DB.ElementId
 The wall type.
Return Value
 True if the wall type is valid for face wall, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FaceWall Class
Autodesk.Revit.DB Namespace